Revit 2026 API

# ViewSheetSettingDelete Method

---

Delete the current view sheet set, and make the In-Session set as the current one.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Delete()
```
```vb
Public Function Delete As Boolean
```
```cpp
public:
bool Delete()
```
```fsharp
member Delete : unit -> bool
```

#### Return Value

BooleanFalse if Delete operation fails, otherwise True.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current view sheet set is In-Session. |

If the current view sheet set is In-Session, an InvalidOperationException will be thrown.

#### Reference

ViewSheetSetting Class

Autodesk.Revit.DB Namespace